nc: 1  # number of classes
depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple
anchors:
    # autogenerated by yolo
  - [ 11, 17,   20, 35,  33, 50] # P3/8
  - [ 39, 91,   68, 73,  67,133] # P4/16
  - [123,141,   92,233, 166,223] # P5/32
  - [140,341,  247,322, 225,434] # P6/64
  - [507,230,  348,435, 553,448] # P7/128
backbone:
  # [from, number, module, args]
  [[-1, 1, katana.Grayscale,        []],                  #  0
   [-1, 1, katana.Conv2d,           [1, 4, 3, 2]],        #  1
   [-1, 1, katana.BatchNorm,        [4]],                 #  2
   [-1, 1, katana.ReLU,             [6]],                 #  3 c1
   [-1, 1, katana.InvertedResidual, [4, 4, 8, 2]],        #  4
   [-1, 1, katana.InvertedResidual, [8, 2]],              #  5 c2
   [-1, 1, katana.InvertedResidual, [8, 12, 16, 2]],       #  6
   [-1, 2, katana.InvertedResidual, [16, 6]],             #  7 c3
   [-1, 1, katana.InvertedResidual, [16, 6, 12, 2]],      #  8
   [-1, 6, katana.InvertedResidual, [12, 4]],             #  9 c4
   [-1, 1, katana.InvertedResidual, [12, 4, None, 2]],    # 10
   [-1, 2, katana.InvertedResidual, [12, 4]],             # 11
   [-1, 1, katana.Conv2d,           [12, 48, 3]],         # 12
   [-1, 1, katana.BatchNorm,        [48]],                # 13
   [-1, 1, katana.ReLU,             [6]]]                 # 14 c5

# YOLOv5 v6.0 head
head:
  [[ 7, 1, katana.Conv2d,           [16, 32, 1]],         # 15 p3
   [ 9, 1, katana.Conv2d,           [12, 16, 1]],         # 16 p4
   [14, 1, katana.Conv2d,           [48, 16, 1]],         # 17
   [-1, 1, katana.BatchNorm,        [16]],                # 18 p567
   [-1, 1, katana.Conv2d,           [16, 16, 1]],         # 19 p5
   [18, 1, katana.Conv2d,           [16, 16, 1, 1, True]],# 20
   [-1, 1, katana.ReLU,             [6]],                 # 21
   [-1, 1, katana.Conv2d,           [16, 16, 3, 2, True]],# 22
   [-1, 1, katana.ReLU,             [6]],                 # 23 p67
   [-1, 1, katana.Conv2d,           [16, 16, 1, 1, True]],# 24
   [-1, 1, katana.ReLU,             [6]],                 # 25
   [-1, 1, katana.Conv2d,           [16, 16, 3, 2, True]],# 26
   [-1, 1, katana.ReLU,             [6]],                 # 27 p7
   [15, 1, katana.Head,             [32, 32]],            # 28
   [16, 1, katana.Head,             [16, 16]],            # 29
   [19, 1, katana.Head,             [16, 16]],            # 30
   [23, 1, katana.Head,             [16, 16, 2]],            # 31
   [27, 1, katana.Head,             [16, 16, 1]],            # 32
   [[28, 29, 30, 31, 32], 1, katana.Detect, [nc, anchors,[32, 16, 16, 16, 16]]]   # 43 Detect(P3-P7)
   ]
