nc: 1  # number of classes
kpt_shape: [17, 3]
depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple
chip: sabre
image_shape: [240, 320]
# anchors:
#     # autogenerated by yolo
#   - [0,0, 0,0, 0,0] # P3/8
#   - [0,0, 0,0, 0,0] # P4/16
#   - [0,0, 0,0, 0,0] # P5/32
backbone:
  # [from, number, module, args]
  #src num layer               params                  id     rf  notes
  [[-1, 1, Conv2d,           [3, 16, 3, 2]],         #  0      1 stride -> 2
   [-1, 1, BatchNorm,        [16]],                  #  1      1
   [-1, 1, ReLU,             [6]],                   #  2 c1   1
   [-1, 1, Conv2d,           [16, 64, 3, 2]],        #  3      3 stride -> 4
   [-1, 1, BatchNorm,        [64]],                  #  4      3
   [-1, 1, ReLU,             [6]],                   #  5 c2   3
   [-1, 1, InvertedResidual, [64, 4, 64, 2]],        #  6      7 stride -> 8
   [-1, 2, InvertedResidual, [64, 4]],               #  7     23
   [-1, 1, InvertedResidual, [64, 4]],             #  8 c3  39
   [-1, 1, InvertedResidual, [64, 3, 96, 2]],      #  9     47 stride -> 16
   [-1, 1, InvertedResidual, [96, 2]],             # 10     63
   [-1, 1, InvertedResidual, [96, 2]],             # 11 c4  79
   [-1, 1, InvertedResidual, [96, 2, 96, 2]],      # 12     95 stride -> 32
   [-1, 1, InvertedResidual, [96, 1.5]],             # 13    127
   [-1, 1, InvertedResidual, [96, 1.5]]]             # 14 c5 158

# YOLOv5 v6.0 head
head:
  [[ 8, 1, Head,             [64, 64, 4]],         # 15 o3  71
   [11, 1, Head,             [96, 96, 3]],         # 16 o4 127
   [14, 1, Head,             [96, 96, 2]],         # 17 o5 222
   [[15, 16, 17], 1, Pose, [nc, [17,3], [64, 96, 96]]]   # 43 Detect(P3-P5)
   ]
