nc: 1  # number of classes
kpt_shape: [17, 3]
depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple
chip: sabre
image_shape: [480, 640]
# anchors:
#     # autogenerated by yolo
#   - [0,0, 0,0, 0,0] # P3/8
#   - [0,0, 0,0, 0,0] # P4/16
#   - [0,0, 0,0, 0,0] # P5/32
backbone:
  # [from, number, module, args]
  #src num layer               params                  id  rf  notes
  [[-1, 1, InvertedResidual, [3, 4, 12, 2]],   #  0 c1   1 stride -> 2
   [-1, 1, InvertedResidual, [12, 4, 48, 2]],     #  1 c2   3 stride -> 4
   [-1, 1, InvertedResidual, [48, 4, 48, 2]],    #  2    7 stride -> 8
   [-1, 2, InvertedResidual, [48, 5, 48]],       #  3 c3
   [-1, 1, InvertedResidual, [48, 4, 64, 2]],    #  4     15 stride -> 16
   [-1, 2, InvertedResidual, [64, 3, 64]],           #  5 c4  47
   [-1, 1, InvertedResidual, [64, 2, 64, 2]],    #  6     63 stride -> 32
   [-1, 2, InvertedResidual, [64, 1]]]           #  7 c5 127

# YOLOv5 v6.0 head
head:
  [[ 5, 1, Head,             [64, 64, 3]],       #  8 o4  95
   [ 7, 1, Head,             [64, 64, 3]],       #  9 o5 191
   [[ 8, 9], 1, Pose, [nc, [17,3], [64, 64], 2]]   # 43 Detect(P4-P6)
   ]                              # rfs 127 255
